# Переменные и типы данных
# int, float, bool, str, list, None


# a = 123       #Python - автоматически задаёт тип данных
# b = 1.23
# c = '"Vogue" magazine'       #Можно использовать разные типы кавычек
# print (a)
# print (b)
# print (c)
# print (type(c)) # Чтобы узнать тип данных
# print (a,b,c)   # Интерполяция

# -----------------  Списки (типа  массивов) ---------------------

# list = []   пустой список
# list = [1,2,3]  заполненный принудительно
# print (list)    вывод
# Списки можно заполнять разными типаси данных, но лучше так не делать

